01-A1/mycases/prism-NSCBC-CO2/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 293;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 293;
        value           uniform 293;
    }

    bottomWall
    {
        type            inletOutlet;
        inletValue      uniform 293;
        value           uniform 293;
    }

    topWall
    {
        type            inletOutlet;
        inletValue      uniform 293;
        value           uniform 293;
    }

    prismWall
    {
        type            zeroGradient;
    }

    defaultFaces
    {
        type            empty;
    }
}
// ************************************************************************* //
