01-A1/mycases/prism-NSCBC-CO2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          80;
        startFace       45874;
    }
    outlet
    {
        type            patch;
        nFaces          120;
        startFace       45954;
    }
    bottomWall
    {
        type            patch;
        nFaces          214;
        startFace       46074;
    }
    topWall
    {
        type            patch;
        nFaces          214;
        startFace       46288;
    }
    prismWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          104;
        startFace       46502;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          46240;
        startFace       46606;
    }
)

// ************************************************************************* //
